#include <iostream>


struct A {  int i;  A(): i(5) {}  };


A f() { return A(); }
A&& F() { return std::move(A()); }


int main() {
  f() = A();
  // Об'єкт перебуває безпосередньо
  // на стеку як значення повернення
  // тому тривалість його життя може
  // бути продовжена
  A&& a1 = f(); // prvalue
  // Об'єкт перебуває десь в пам'яті
  // тому тривалість його життя
  // не може бути продовжена
  A&& a2 = F(); // xvalue
  a1.i = 6;
  a2.i = 7; // Небезпечно


  std::cout << a1.i << std::endl; // Ok
  std::cout << a2.i << std::endl;
  // можливий друк сміття
}

